
## Plan Result

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10653125521)


<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * local_file.index_page
* Update
  * aws_dynamodb_table.Link_table
  * aws_s3_bucket.images
  * aws_s3_bucket.website


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_dynamodb_table.Link_table will be updated in-place
  ~ resource "aws_dynamodb_table" "Link_table" {
      ~ billing_mode   = "PROVISIONED" -> "PAY_PER_REQUEST"
        id             = "Link_table"
        name           = "Link_table"
      ~ read_capacity  = 1 -> 3
        tags           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (5 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":189,"Program":"tfcmt","SHA1":"de027ea99062da07102529d10515c8e1502825af","Vars":{},"WorkflowName":"Deploy cases"} -->